; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v13 ?v1)
             (pred_6 ?v6 ?v9)
             (pred_10 ?v13 ?v9)
             (pred_3 ?v12 ?v13 )
	     (pred_9 ?v13)
             (pred_2 ?v8)
             (pred_4 ?v6)
             (pred_8 ?v9)
             (pred_11 ?v13)
             (pred_12 ?v6)
             (pred_1 ?v13)
             (pred_7 ))



(:action op_5
:parameters (?v10 ?v11 ?v3 ?v7)
:precondition (and (pred_2 ?v10) (pred_2 ?v11) (pred_4 ?v3) (pred_8 ?v7)
          (pred_5 ?v10 ?v11) (pred_6 ?v3 ?v7)
                   (pred_10 ?v11 ?v7) (pred_9 ?v10) 
                   (pred_11 ?v11) (pred_12 ?v3))
:effect (and  (pred_1 ?v11) (not (pred_11 ?v11))))


(:action op_2
:parameters (?v10 ?v2)
:precondition (and (pred_2 ?v10) (pred_2 ?v2)
               (pred_9 ?v10) (pred_5 ?v10 ?v2) (pred_1 ?v2))
:effect (and (pred_9 ?v2) (not (pred_9 ?v10))))

(:action op_4
:parameters (?v10 ?v3)
:precondition (and (pred_2 ?v10) (pred_4 ?v3) 
                  (pred_9 ?v10) (pred_3 ?v3 ?v10) (pred_7 ))
:effect (and (pred_12 ?v3)
   (not (pred_3 ?v3 ?v10)) (not (pred_7 ))))


(:action op_1
:parameters (?v10 ?v5 ?v4)
:precondition (and (pred_2 ?v10) (pred_4 ?v5) (pred_4 ?v4)
                  (pred_9 ?v10) (pred_12 ?v4) (pred_3 ?v5 ?v10))
:effect (and (pred_12 ?v5) (pred_3 ?v4 ?v10)
        (not (pred_12 ?v4)) (not (pred_3 ?v5 ?v10))))

(:action op_3
:parameters (?v10 ?v3)
:precondition (and (pred_2 ?v10) (pred_4 ?v3) 
                  (pred_9 ?v10) (pred_12 ?v3))
:effect (and (pred_7 ) (pred_3 ?v3 ?v10) (not (pred_12 ?v3)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_31 obj_19 obj_17 obj_25 obj_24 obj_02 obj_13 obj_23 obj_07 obj_22 obj_03 obj_14 obj_26 obj_20 obj_04 obj_30 obj_05 obj_12 obj_18 obj_28 obj_29 obj_01 obj_16 obj_21 obj_06
    obj_32 obj_10 obj_09
    obj_08 obj_27 obj_11 obj_15
    )

    (:init
       (pred_7)

       (pred_2 obj_31)
       (pred_2 obj_19)
       (pred_2 obj_17)
       (pred_2 obj_25)
       (pred_2 obj_24)
       (pred_2 obj_02)
       (pred_2 obj_13)
       (pred_2 obj_23)
       (pred_2 obj_07)
       (pred_2 obj_22)
       (pred_2 obj_03)
       (pred_2 obj_14)
       (pred_2 obj_26)
       (pred_2 obj_20)
       (pred_2 obj_04)
       (pred_2 obj_30)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_18)
       (pred_2 obj_28)
       (pred_2 obj_29)
       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_21)
       (pred_2 obj_06)
       (pred_8 obj_32)
       (pred_8 obj_10)
       (pred_8 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_27)
       (pred_4 obj_11)
       (pred_4 obj_15)

       (pred_5 obj_31 obj_02)
       (pred_5 obj_31 obj_19)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_19 obj_17)
       (pred_5 obj_19 obj_31)
       (pred_5 obj_17 obj_23)
       (pred_5 obj_17 obj_25)
       (pred_5 obj_17 obj_19)
       (pred_5 obj_25 obj_07)
       (pred_5 obj_25 obj_24)
       (pred_5 obj_25 obj_17)
       (pred_5 obj_24 obj_22)
       (pred_5 obj_24 obj_25)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_31)
       (pred_5 obj_13 obj_14)
       (pred_5 obj_13 obj_23)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_23 obj_26)
       (pred_5 obj_23 obj_07)
       (pred_5 obj_23 obj_17)
       (pred_5 obj_23 obj_13)
       (pred_5 obj_07 obj_20)
       (pred_5 obj_07 obj_22)
       (pred_5 obj_07 obj_25)
       (pred_5 obj_07 obj_23)
       (pred_5 obj_22 obj_04)
       (pred_5 obj_22 obj_24)
       (pred_5 obj_22 obj_07)
       (pred_5 obj_03 obj_30)
       (pred_5 obj_03 obj_14)
       (pred_5 obj_03 obj_02)
       (pred_5 obj_14 obj_05)
       (pred_5 obj_14 obj_26)
       (pred_5 obj_14 obj_13)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_26 obj_12)
       (pred_5 obj_26 obj_20)
       (pred_5 obj_26 obj_23)
       (pred_5 obj_26 obj_14)
       (pred_5 obj_20 obj_18)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_20 obj_07)
       (pred_5 obj_20 obj_26)
       (pred_5 obj_04 obj_28)
       (pred_5 obj_04 obj_22)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_30 obj_29)
       (pred_5 obj_30 obj_05)
       (pred_5 obj_30 obj_03)
       (pred_5 obj_05 obj_01)
       (pred_5 obj_05 obj_12)
       (pred_5 obj_05 obj_14)
       (pred_5 obj_05 obj_30)
       (pred_5 obj_12 obj_16)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_26)
       (pred_5 obj_12 obj_05)
       (pred_5 obj_18 obj_21)
       (pred_5 obj_18 obj_28)
       (pred_5 obj_18 obj_20)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_28 obj_06)
       (pred_5 obj_28 obj_04)
       (pred_5 obj_28 obj_18)
       (pred_5 obj_29 obj_01)
       (pred_5 obj_29 obj_30)
       (pred_5 obj_01 obj_16)
       (pred_5 obj_01 obj_05)
       (pred_5 obj_01 obj_29)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_16 obj_12)
       (pred_5 obj_16 obj_01)
       (pred_5 obj_21 obj_06)
       (pred_5 obj_21 obj_18)
       (pred_5 obj_21 obj_16)
       (pred_5 obj_06 obj_28)
       (pred_5 obj_06 obj_21)
       (pred_11 obj_07)
       (pred_11 obj_24)
       (pred_11 obj_21)
       (pred_11 obj_12)
       (pred_10  obj_07 obj_32)
       (pred_10  obj_24 obj_10)
       (pred_10  obj_21 obj_09)
       (pred_10  obj_12 obj_10)
       (pred_1 obj_31)
       (pred_1 obj_19)
       (pred_1 obj_17)
       (pred_1 obj_25)
       (pred_1 obj_02)
       (pred_1 obj_13)
       (pred_1 obj_23)
       (pred_1 obj_22)
       (pred_1 obj_03)
       (pred_1 obj_14)
       (pred_1 obj_26)
       (pred_1 obj_20)
       (pred_1 obj_04)
       (pred_1 obj_30)
       (pred_1 obj_05)
       (pred_1 obj_18)
       (pred_1 obj_28)
       (pred_1 obj_29)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_1 obj_06)

       (pred_6  obj_08 obj_32)
       (pred_6  obj_27 obj_10)
       (pred_6  obj_11 obj_09)
       (pred_6  obj_15 obj_10)
       (pred_3 obj_08 obj_20)
       (pred_3 obj_27 obj_05)
       (pred_3 obj_11 obj_31)
       (pred_3 obj_15 obj_25)
       (pred_9 obj_14)
    )

    (:goal (and
       (pred_3 obj_08 obj_05)
       (pred_3 obj_27 obj_30)
       (pred_3 obj_15 obj_23)
    ))
(:constraints
  (always (not (pred_9 obj_13)))
)
)

; plan
1. (op_2 obj_14 obj_26)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_26)
   goals met: 0 of 3
2. (op_2 obj_26 obj_20)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_20)
   goals met: 0 of 3
3. (op_4 obj_20 obj_08)
   deleted: (pred_3 obj_08 obj_20) (pred_7)
   added: (pred_12 obj_08)
   goals met: 0 of 3
4. (op_2 obj_20 obj_26)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_26)
   goals met: 0 of 3
5. (op_2 obj_26 obj_14)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_14)
   goals met: 0 of 3
6. (op_2 obj_14 obj_05)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_05)
   goals met: 0 of 3
7. (op_1 obj_05 obj_27 obj_08)
   deleted: (pred_12 obj_08) (pred_3 obj_27 obj_05)
   added: (pred_12 obj_27) (pred_3 obj_08 obj_05)
   goals met: 1 of 3
8. (op_5 obj_05 obj_12 obj_27 obj_10)
   deleted: (pred_11 obj_12)
   added: (pred_1 obj_12)
   goals met: 1 of 3
9. (op_2 obj_05 obj_12)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_12)
   goals met: 1 of 3
10. (op_2 obj_12 obj_26)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_26)
   goals met: 1 of 3
11. (op_2 obj_26 obj_23)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_23)
   goals met: 1 of 3
12. (op_2 obj_23 obj_17)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_17)
   goals met: 1 of 3
13. (op_2 obj_17 obj_25)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_25)
   goals met: 1 of 3
14. (op_1 obj_25 obj_15 obj_27)
   deleted: (pred_12 obj_27) (pred_3 obj_15 obj_25)
   added: (pred_12 obj_15) (pred_3 obj_27 obj_25)
   goals met: 1 of 3
15. (op_2 obj_25 obj_17)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_17)
   goals met: 1 of 3
16. (op_2 obj_17 obj_23)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_23)
   goals met: 1 of 3
17. (op_3 obj_23 obj_15)
   deleted: (pred_12 obj_15)
   added: (pred_7) (pred_3 obj_15 obj_23)
   goals met: 2 of 3
18. (op_2 obj_23 obj_17)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_17)
   goals met: 2 of 3
19. (op_2 obj_17 obj_25)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_25)
   goals met: 2 of 3
20. (op_4 obj_25 obj_27)
   deleted: (pred_3 obj_27 obj_25) (pred_7)
   added: (pred_12 obj_27)
   goals met: 2 of 3
21. (op_2 obj_25 obj_17)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_17)
   goals met: 2 of 3
22. (op_2 obj_17 obj_19)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_19)
   goals met: 2 of 3
23. (op_2 obj_19 obj_31)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_31)
   goals met: 2 of 3
24. (op_2 obj_31 obj_02)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_02)
   goals met: 2 of 3
25. (op_2 obj_02 obj_03)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_03)
   goals met: 2 of 3
26. (op_2 obj_03 obj_30)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_30)
   goals met: 2 of 3
27. (op_3 obj_30 obj_27)
   deleted: (pred_12 obj_27)
   added: (pred_7) (pred_3 obj_27 obj_30)
   goals met: 3 of 3
